# โจทย์
# ให้นักเรียนรับจำนวนเต็ม 2 จำนวน  แล้วแสดงตัวเลขตั้งแต่จำนวนจาก A ไป B
# ถ้า  A < B  ให้เรียงจากน้อยไปหามาก
# ถ้า  A ≥  B ให้เรียงจากมากไปหาน้อย

# รับค่า a และ b
a = int(input())
b = int(input())

# คำนวณจำนวนn n รอบ ที่ต้องแสดงค่า 
if (a>=b) :
  n = a-b+1
else :  
  n = b-a+1

# วนโดยใช้ for loop จำนวน n รอบ
for i in range (n) :
  if (a<b):                     # ถ้า a < b ให้แสดงจากน้อยไปมาก คือ แสดงจาก a แล้วบวกเพิ่มอีก 1 จนครบ n รอบ
    print (a,end=' ')
    a = a+1
  else :                        # ถ้า a >= b ให้แสดงจากมากไปน้อย คือ แสดงจาก a แล้วลดลงทีละ 1 จนครบ n รอบ
    print (a,end=' ')
    a = a-1
